app/views/companies/show.html.erb

SELECT "employees".* FROM "employees"  WHERE "employees"."company_id" = $1  [["company_id", 1]]
---
<h3>Employees List</h3>
<%if @company.employees.present?  %>