app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("company_address", "company_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["company_address", "dadar mumbai"], ["company_name", "new "], ["created_at", "2023-01-23 18:27:35.295242"], ["updated_at", "2023-01-23 18:27:35.295242"]]