app/controllers/employees_controller.rb

  def create
      file = employee_params[:file]
      file_ext = File.extname(file.original_filename)
      spreadsheet =  Roo::Excel.new(file.path, packed: false, file_warning: :ignore)
      spreadsheet.row(1).map!(&:downcase!)
      header = spreadsheet.row(1)
      (2..spreadsheet.last_row).each do |i|
        combined_data = Hash[header.zip(spreadsheet.row(i))]
        @employee = Employee.new(combined_data)
        @employee.company_id = params[:employee][:company_id]
      end

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("contact_no", "created_at", "email", "gender", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["contact_no", ""], ["created_at", "2023-01-23 19:25:30.571063"], ["email", ""], ["gender", ""], ["name", ""], ["updated_at", "2023-01-23 19:25:30.571063"]]

  def destroy
    # byebug
    @company = @employee.company
    @employee.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 32]]